var city_list ={
    "1": ["北京", "廊坊"],
    "2": ["上海"],
    "3": ["广州", "清远", "中山", "珠海", "江门", "湛江"],
    "4": ["天津"],
    "5": ["成都", "攀枝花", "自贡", "绵阳", "南充", "达川", "遂宁", "广安", "巴中", "泸州", "宜宾", "资阳", "乐山", "西昌", "雅安", "九寨沟", "南坪", "德阳", "广元", "理县", "汶川", "松潘"],
    "6": ["杭州", "金华", "湖州", "嘉兴", "绍兴"],
    "7": ["重庆"],
    "8": ["沈阳", "鞍山", "抚顺", "本溪", "凌海", "葫芦岛", "盘锦", "阜新", "辽阳", "铁岭", "朝阳"],
    "9": ["济南", "淄博", "泰安", "德州", "菏泽", "聊城", "莱芜", "济宁"],
    "10": ["青岛", "日照", "潍坊", "临沂", "枣庄"],
    "11": ["郑州", "新乡", "鹤壁", "安阳", "商丘", "焦作", "开封", "濮阳", "许昌", "平顶山", "南阳", "漯河", "驻马店", "信阳", "周口"],
    "12": ["石家庄", "沧州", "张家口", "保定"],
    "13": ["大连", "丹东", "营口"],
    "14": ["武汉", "鄂州", "黄冈", "黄石", "咸宁", "孝感", "仙桃", "随州", "天门", "十堰", "襄阳", "潜江"],
    "15": ["西安", "铜川", "宝鸡", "咸阳", "渭南", "榆林", "延安", "商州", "安康", "汉中"],
    "16": ["南京", "盐城", "扬州", "淮安"],
    "17": ["太原", "大同", "朔州", "忻州", "临汾", "长治", "晋城", "运城"],
    "18": ["唐山", "承德", "秦皇岛"],
    "19": ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "桂阳", "石门", "永顺"],
    "20": ["深圳", "汕尾", "揭阳", "汕头", "潮州"],
    "21": ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "大理", "元阳", "马关", "武定", "东川", "兰坪", "中甸"],
    "22": ["合肥", "蚌埠", "淮南", "淮北", "铜陵", "安庆", "黄山", "阜阳", "宿州", "滁州", "六安", "宣城", "巢湖", "毫州", "青阳"],
    "23": ["苏州", "南通"],
    "24": ["哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "加格达奇"],
    "25": ["长春", "四平", "辽源", "松原", "白城", "梅河口"],
    "26": ["呼和浩特", "海拉尔", "包头", "乌海", "集宁", "通辽", "赤峰", "东胜", "临河", "锡林浩特", "牙克石", "扎兰屯", "满洲里", "二连浩特", "乌兰浩特", "霍林郭勒"],
    "27": ["兰州", "临夏县", "定西", "平凉", "庆阳", "威武", "张掖", "嘉峪关", "天水", "康县", "夏河", "白银", "永靖"],
    "28": ["厦门", "泉州", "漳州", "龙岩"],
    "29": ["南昌", "鹰潭", "新余", "九江", "上饶", "抚州", "宜春", "吉安", "赣州", "景德镇", "萍乡"],
    "30": ["吉林", "通化", "白山", "安图", "珲春", "延边"],
    "31": ["烟台", "威海", "东营", "滨州"],
    "32": ["邯郸", "邢台县", "衡水"],
    "33": ["无锡", "泰州"],
    "34": ["宁波", "舟山", "台州"],
    "35": ["贵阳", "六盘水", "遵义", "安顺", "铜仁", "毕节"],
    "36": ["徐州", "连云港", "宿迁"],
    "37": ["佛山", "茂名", "阳江", "云浮", "肇庆"],
    "38": ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
    "39": ["福州", "宁德", "莆田", "三明", "南平"],
    "40": ["银川", "石嘴山", "吴忠", "固原", "中卫"],
    "41": ["常州", "镇江"],
    "42": ["温州", "丽水", "衢州"],
    "43": ["东莞", "惠州", "河源", "韶关", "梅州"],
    "44": ["宜昌", "神农架", "恩施", "荆州", "荆门"],
    "45": ["西宁", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州", "海东"],
    "48": ["洛阳", "三门峡", "济源"]
};
var province_list = {
    "2": ["上海"],
    "3": ["广州"],
    "4": ["天津"],
    "5": ["四川"],
    "7": ["重庆"],
    "9": ["山东"],
    "11": ["河南"],
    "12": ["河北"],
    "13": ["辽宁"],
    "14": ["湖北"],
    "15": ["陕西"],
    "17": ["山西"],
    "19": ["湖南"],
    "21": ["云南"],
    "22": ["安徽"],
    "24": ["黑龙江"],
    "25": ["吉林"],
    "26": ["内蒙古"],
    "27": ["甘肃"],
    "29": ["江西"],
    "33": ["江苏"],
    "35": ["贵州"],
    "38": ["广西"],
    "39": ["福建"],
    "40": ["宁夏"],
    "42": ["浙江"],
    "45": ["青海"],
    "46": ["海南"],
    "47": ["新疆"],
    "48": ["洛阳"]
};

function get_area_code(cityName){
	var area_code = 0;
	for (var i in city_list) {
		//console.log(city_list[i]);
		for (var j in city_list[i]) {
			//console.log(city_list[i][j]);
			if(cityName.indexOf(city_list[i][j]) >= 0){
				area_code = i;
				break;
			}
		}
		if(area_code > 0){
			break;
		}
	}
	if(area_code == 0){
		for (var i in province_list) {
			if(cityName.indexOf(province_list[i][0]) >= 0){
				//console.log(city_list[i][j]);
				area_code = i;
				break;
			}
		}
	}

	return area_code ? area_code : 1;
}

module.exports =get_area_code;